public class Main {
    public static void main(String[] args) {

//    2. Создать Spring (не MVC) приложение. Взять класс Passport из предыдущей задачи и заменить DAO-паттерн на spring data repository.
//    В Main проверить работу базовых методов: получение всех паспортов, получение по id, сохранение, удаление (через репозиторий).
//    Добавить свои методы в репозиторий, используя query methods:
//    - получение объекта паспорта по его серии (согласно статье https://docs.spring.io/spring-data/jpa/docs/current/reference/html/#jpa.query-methods
//    название метода можно делать не getPassportBy..., а findBy....);
//    - получение объекта паспорта по его серии и номеру;
//    - написать какой-нибудь свой метод.
//    Проверить работу созданных методов.

    }
}
